tap "homebrew/cask"
tap "homebrew/cask-fonts"

# General
brew "asdf"
brew "awscli"
# Syntax Highlighting https://github.com/sharkdp/bat
brew "bat"
brew "fish"
brew "fzf"
brew "git-delta"
brew "git"
brew "autojump"

# Used by vault
brew "wdiff"
brew "jq"
brew "colordiff"

# asdf dependencies for building Erlang
brew "autoconf"
brew "wxmac" if OS.mac?

# Casks
cask "font-jetbrains-mono"
cask "gpg-suite"
cask "visual-studio-code"
cask "mattermost"
cask "google-chrome"
cask "datagrip"
cask "slack"
cask "rectangle"
cask "docker"
cask "flycut"