# brew bundle --no-lock --file=.Brewfile

# tap "homebrew/cask" not needed anymore?
tap "homebrew/cask-fonts"
tap "TylerBrock/saw"

# General
brew "amazon-ecs-cli"
brew "asdf"
brew "autojump"
brew "awscli"
brew "saw"
brew "jq"
brew "sshuttle"
# brew "twilio"

# Syntax Highlighting https://github.com/sharkdp/bat
brew "bat"

brew "fish"
brew "fzf"
brew "git"
brew "git-delta"

# Used by vault
brew "colordiff"
brew "wdiff"

# Used by asdf-nodejs
brew "coreutils"
brew "gpg"

# asdf dependencies for building Erlang
# brew "erlang", args: ["only-dependencies"]
brew "autoconf"
# Appears to be deprecated in favor of wxwidgets
# brew "wxmac" if OS.mac?
brew "openssl@1.1"
brew "wxwidgets"
brew "postgis"
# Casks

cask "datagrip"
cask "docker"
cask "firefox"
cask "flycut"
cask "font-jetbrains-mono"
cask "google-chrome"
cask "gpg-suite"
cask "iTerm2"
cask "mattermost"
cask "pritunl"
cask "rectangle"
# cask "safeincloud-password-manager"
cask "slack"
cask "visual-studio-code"
cask "postman"
cask "aws-vault"
cask "ngrok"
cask "obsidian"

# Keyboard
# cask "karabiner-elements"

# brew bundle --no-lock --file=.Brewfile
